{"format": "graph-model", "generatedBy": "2.12.0", "convertedBy": "TensorFlow.js Converter v4.10.0", "signature": {"inputs": {"lstm_input": {"name": "lstm_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "12"}, {"size": "1"}]}}}, "outputs": {"dense_2": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential/lstm/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice_3/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice_3/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice_3/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}, {"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/loop_counter", "op": "Const", "attr": {"_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/maximum_iterations", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/time", "op": "Const", "attr": {"_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "Func/StatefulPartitionedCall/input/_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "lstm_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "12"}, {"size": "1"}]}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential/lstm/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential/lstm/TensorArrayV2_1/num_elements"], "attr": {"_has_manual_control_dependencies": {"b": true}, "shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/Shape", "op": "Shape", "input": ["lstm_input"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/transpose", "op": "Transpose", "input": ["lstm_input", "StatefulPartitionedCall/sequential/lstm/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm/Shape", "StatefulPartitionedCall/sequential/lstm/strided_slice/stack", "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_1", "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/lstm/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential/lstm/transpose", "StatefulPartitionedCall/sequential/lstm/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"_has_manual_control_dependencies": {"b": true}, "shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/lstm/strided_slice", "StatefulPartitionedCall/sequential/lstm/zeros_1/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/lstm/strided_slice", "StatefulPartitionedCall/sequential/lstm/zeros/packed/1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm/Shape_1", "StatefulPartitionedCall/sequential/lstm/strided_slice_1/stack", "StatefulPartitionedCall/sequential/lstm/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential/lstm/strided_slice_1/stack_2"], "attr": {"begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/lstm/zeros_1/packed", "StatefulPartitionedCall/sequential/lstm/zeros_1/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/lstm/zeros/packed", "StatefulPartitionedCall/sequential/lstm/zeros/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/LoopControlInputs/_25", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential/lstm/strided_slice_1", "^StatefulPartitionedCall/sequential/lstm/zeros_1", "^StatefulPartitionedCall/sequential/lstm/zeros", "^StatefulPartitionedCall/sequential/lstm/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential/lstm/TensorArrayV2_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/enter/_17", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/TensorArrayV2_1", "^StatefulPartitionedCall/sequential/lstm/while/LoopControlInputs/_25"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL3doaWxl"}, "is_constant": {"b": false}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/enter/_19", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/zeros_1", "^StatefulPartitionedCall/sequential/lstm/while/LoopControlInputs/_25"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL3doaWxl"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/enter/_20", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/strided_slice_1", "^StatefulPartitionedCall/sequential/lstm/while/LoopControlInputs/_25"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/enter/_14", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/while/loop_counter", "^StatefulPartitionedCall/sequential/lstm/while/LoopControlInputs/_25"], "attr": {"T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL3doaWxl"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/enter/_15", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/while/maximum_iterations", "^StatefulPartitionedCall/sequential/lstm/while/LoopControlInputs/_25"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL3doaWxl"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/enter/_18", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/zeros", "^StatefulPartitionedCall/sequential/lstm/while/LoopControlInputs/_25"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL3doaWxl"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/enter/_21", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential/lstm/while/LoopControlInputs/_25"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL3doaWxl"}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/enter/_16", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/time", "^StatefulPartitionedCall/sequential/lstm/while/LoopControlInputs/_25"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL3doaWxl"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/enter/_22", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_1", "^StatefulPartitionedCall/sequential/lstm/while/LoopControlInputs/_25"], "attr": {"parallel_iterations": {"i": "32"}, "_has_manual_control_dependencies": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/enter/_23", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_2", "^StatefulPartitionedCall/sequential/lstm/while/LoopControlInputs/_25"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL3doaWxl"}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/enter/_24", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_3", "^StatefulPartitionedCall/sequential/lstm/while/LoopControlInputs/_25"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL3doaWxl"}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/merge/_29", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/while/enter/_17", "StatefulPartitionedCall/sequential/lstm/while/next_iteration/_56"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/merge/_31", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/while/enter/_19", "StatefulPartitionedCall/sequential/lstm/while/next_iteration/_58"], "attr": {"T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/merge/_32", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/while/enter/_20", "StatefulPartitionedCall/sequential/lstm/while/next_iteration/_59"], "attr": {"_has_manual_control_dependencies": {"b": true}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/merge/_26", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/while/enter/_14", "StatefulPartitionedCall/sequential/lstm/while/next_iteration/_53"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/merge/_27", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/while/enter/_15", "StatefulPartitionedCall/sequential/lstm/while/next_iteration/_54"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/merge/_30", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/while/enter/_18", "StatefulPartitionedCall/sequential/lstm/while/next_iteration/_57"], "attr": {"T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/merge/_33", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/while/enter/_21", "StatefulPartitionedCall/sequential/lstm/while/next_iteration/_60"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/merge/_28", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/while/enter/_16", "StatefulPartitionedCall/sequential/lstm/while/next_iteration/_55"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/cond/_12/sequential/lstm/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential/lstm/while/merge/_28", "StatefulPartitionedCall/sequential/lstm/while/merge/_32", "^StatefulPartitionedCall/sequential/lstm/while/merge/_33", "^StatefulPartitionedCall/sequential/lstm/while/enter/_22", "^StatefulPartitionedCall/sequential/lstm/while/enter/_23", "^StatefulPartitionedCall/sequential/lstm/while/enter/_24", "^StatefulPartitionedCall/sequential/lstm/while/merge/_26", "^StatefulPartitionedCall/sequential/lstm/while/merge/_27", "^StatefulPartitionedCall/sequential/lstm/while/merge/_29", "^StatefulPartitionedCall/sequential/lstm/while/merge/_30", "^StatefulPartitionedCall/sequential/lstm/while/merge/_31"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/LoopCond/_34", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential/lstm/while/cond/_12/sequential/lstm/while/Less"]}, {"name": "StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/strided_slice_1_switch/_41", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/while/merge/_32", "StatefulPartitionedCall/sequential/lstm/while/LoopCond/_34"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/while/loop_counter_switch/_35", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/while/merge/_26", "StatefulPartitionedCall/sequential/lstm/while/LoopCond/_34"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/while/maximum_iterations_switch/_36", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/while/merge/_27", "StatefulPartitionedCall/sequential/lstm/while/LoopCond/_34"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/zeros_1_switch/_40", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/while/merge/_31", "StatefulPartitionedCall/sequential/lstm/while/LoopCond/_34"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/TensorArrayUnstack/TensorListFromTensor_switch/_42", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/while/merge/_33", "StatefulPartitionedCall/sequential/lstm/while/LoopCond/_34"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/time_switch/_37", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/while/merge/_28", "StatefulPartitionedCall/sequential/lstm/while/LoopCond/_34"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/zeros_switch/_39", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/while/merge/_30", "StatefulPartitionedCall/sequential/lstm/while/LoopCond/_34"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/TensorArrayV2_1_switch/_38", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/while/merge/_29", "StatefulPartitionedCall/sequential/lstm/while/LoopCond/_34"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/exit/_50", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/strided_slice_1_switch/_41"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/exit/_44", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/while/loop_counter_switch/_35"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/loop_body_control/_43", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/while/loop_counter_switch/_35:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/exit/_45", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/while/maximum_iterations_switch/_36"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/exit/_49", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/zeros_1_switch/_40"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/exit/_51", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/TensorArrayUnstack/TensorListFromTensor_switch/_42"], "attr": {"T": {"type": "DT_VARIANT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/exit/_46", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/time_switch/_37"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/exit/_48", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/zeros_switch/_39"], "attr": {"T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/exit/_47", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/TensorArrayV2_1_switch/_38"], "attr": {"T": {"type": "DT_VARIANT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/sequential/lstm/while/body/_13/input_control_node/_74", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/TensorArrayUnstack/TensorListFromTensor_switch/_42", "^StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/TensorArrayV2_1_switch/_38", "^StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/strided_slice_1_switch/_41", "^StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/time_switch/_37", "^StatefulPartitionedCall/sequential/lstm/while/loop_body_control/_43", "^StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/while/maximum_iterations_switch/_36", "^StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/zeros_1_switch/_40", "^StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/zeros_switch/_39", "^StatefulPartitionedCall/sequential/lstm/while/enter/_22", "^StatefulPartitionedCall/sequential/lstm/while/enter/_23", "^StatefulPartitionedCall/sequential/lstm/while/enter/_24"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/lstm/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential/lstm/while/exit/_47", "StatefulPartitionedCall/sequential/lstm/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/TensorArrayV2Write/TensorListSetItem/index", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm/while/body/_13/input_control_node/_74"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/add_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm/while/body/_13/input_control_node/_74"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/split/split_dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm/while/body/_13/input_control_node/_74"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm/while/body/_13/input_control_node/_74"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm/while/body/_13/input_control_node/_74"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/MatMul/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/while/enter/_22", "^Func/StatefulPartitionedCall/sequential/lstm/while/body/_13/input_control_node/_74"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/MatMul_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/while/enter/_23", "^Func/StatefulPartitionedCall/sequential/lstm/while/body/_13/input_control_node/_74"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/while/enter/_24", "^Func/StatefulPartitionedCall/sequential/lstm/while/body/_13/input_control_node/_74"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice_3", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential/lstm/strided_slice_3/stack", "StatefulPartitionedCall/sequential/lstm/strided_slice_3/stack_1", "StatefulPartitionedCall/sequential/lstm/strided_slice_3/stack_2"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/while/loop_counter_switch/_35:1", "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/add_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/time_switch/_37:1", "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/add/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/TensorArrayUnstack/TensorListFromTensor_switch/_42:1", "StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/time_switch/_37:1", "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/zeros_switch/_39:1", "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/MatMul_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential/lstm/while/body/_13/output_control_node/_97", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/MatMul/ReadVariableOp", "^StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/MatMul_1/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/MatMul/ReadVariableOp", "^StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/MatMul_1/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}, "_acd_function_control_output": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/lstm/strided_slice_3", "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/MatMul_1"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/next_iteration/_59", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/strided_slice_1_switch/_41:1", "^Func/StatefulPartitionedCall/sequential/lstm/while/body/_13/output_control_node/_97", "^Func/StatefulPartitionedCall/sequential/lstm/while/body/_13/input_control_node/_74"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/next_iteration/_60", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/TensorArrayUnstack/TensorListFromTensor_switch/_42:1", "^Func/StatefulPartitionedCall/sequential/lstm/while/body/_13/output_control_node/_97", "^Func/StatefulPartitionedCall/sequential/lstm/while/body/_13/input_control_node/_74"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/next_iteration/_53", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/add_1", "^Func/StatefulPartitionedCall/sequential/lstm/while/body/_13/output_control_node/_97", "^StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/next_iteration/_54", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/while/maximum_iterations_switch/_36:1", "^Func/StatefulPartitionedCall/sequential/lstm/while/body/_13/output_control_node/_97", "^StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/NoOp", "^Func/StatefulPartitionedCall/sequential/lstm/while/body/_13/input_control_node/_74"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/next_iteration/_55", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/add", "^Func/StatefulPartitionedCall/sequential/lstm/while/body/_13/output_control_node/_97", "^StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/dense/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/add", "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/dense/Tanh", "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/split", "op": "Split", "input": ["StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/split/split_dim", "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/BiasAdd"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/dense_1/Tanh", "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/Sigmoid_1", "StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/zeros_1_switch/_40:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/Sigmoid", "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/dense_2/BiasAdd", "^StatefulPartitionedCall/sequential/lstm/while/exit/_51", "^StatefulPartitionedCall/sequential/lstm/while/exit/_50", "^StatefulPartitionedCall/sequential/lstm/while/exit/_48", "^StatefulPartitionedCall/sequential/lstm/while/exit/_49", "^StatefulPartitionedCall/sequential/lstm/while/exit/_44", "^StatefulPartitionedCall/sequential/lstm/while/exit/_45", "^StatefulPartitionedCall/sequential/lstm/while/exit/_46", "^StatefulPartitionedCall/sequential/lstm/while/exit/_47"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/mul", "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/Relu_1", "op": "Relu", "input": ["StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/next_iteration/_58", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/add_1", "^Func/StatefulPartitionedCall/sequential/lstm/while/body/_13/output_control_node/_97", "^StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/Sigmoid_2", "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["StatefulPartitionedCall/sequential/lstm/while/StatefulPartitionedCall/sequential/lstm/TensorArrayV2_1_switch/_38:1", "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/TensorArrayV2Write/TensorListSetItem/index", "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/mul_2"], "attr": {"resize_if_index_out_of_bounds": {"b": false}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/next_iteration/_57", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/mul_2", "^Func/StatefulPartitionedCall/sequential/lstm/while/body/_13/output_control_node/_97", "^StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/while/next_iteration/_56", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/TensorArrayV2Write/TensorListSetItem", "^Func/StatefulPartitionedCall/sequential/lstm/while/body/_13/output_control_node/_97", "^StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/NoOp"], "attr": {"T": {"type": "DT_VARIANT"}}}], "library": {}, "versions": {"producer": 1482}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential/lstm/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice_3/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice_3/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice_3/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "shape": [100, 50], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "shape": [50], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "shape": [50, 25], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp", "shape": [25], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp", "shape": [25, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/while/maximum_iterations", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/time", "shape": [], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_1", "shape": [1, 400], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_2", "shape": [100, 400], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_3", "shape": [400], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/TensorArrayUnstack/TensorListFromTensor/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/TensorArrayV2_1/num_elements", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/TensorArrayV2Write/TensorListSetItem/index", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/add_1/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/add/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/TensorArrayV2Read/TensorListGetItem/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/MatMul/ReadVariableOp", "shape": [1, 400], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/MatMul_1/ReadVariableOp", "shape": [100, 400], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/while/body/_13/sequential/lstm/while/lstm_cell/BiasAdd/ReadVariableOp", "shape": [400], "dtype": "float32"}]}]}